#+SETUPFILE: ~/.emacs.d/org-templates/base.org
#+TITLE: Notes about the experimental protocol
#+DESCRIPTION:
#+KEYWORDS:
#+TEXT:
#+OPTIONS: H:2 num:nil toc:2
#+LANGUAGE: en
#+PROPERTY: header-args :results silent :exports code :session cryptarithm
#+HTML_HEAD:    <link rel="stylesheet" type="text/css" href="http://www.i3s.unice.fr/~malapert/css/worg.min.css" />
*** Status


   #+BEGIN_SRC R :results output replace
     table( data[ c("a", "s")])
  #+END_SRC

  #+RESULTS:
  :         s
  : a        STOPPED TERMINATED UNKNOWN
  :   BIGNUM       0      35800       0
  :   CRYPT        0      35104      18
  :   HORNER    4146      31654       0
  :   SCALAR       0      35800       0


**** Statistics
   #+BEGIN_SRC R :results output replace
     gmean <- function(x) exp(mean(log(x)))
     data  %>% filter( s == "TERMINATED") %>%
         group_by(a) %>%
         summarise(
             n = n(), median = median(TIME),
             mean = mean(TIME), sd = sd(TIME),
             gmean = gmean(TIME)
         )
   #+END_SRC

   #+RESULTS:
   : # A tibble: 4 × 6
   :   a          n median    mean      sd gmean
   :   <chr>  <int>  <dbl>   <dbl>   <dbl> <dbl>
   : 1 BIGNUM 35800  0.133  1.56    4.67   0
   : 2 CRYPT  35104  0.01   0.0273  0.0513 0
   : 3 HORNER 31654  8.02  16.6    20.6    7.15
   : 4 SCALAR 35800  0.115  0.355   0.858  0.115

   #+BEGIN_SRC R :results output replace
     gmean <- function(x) exp(mean(log(x)))
     x <- data  %>% filter( s == "TERMINATED") %>%
         group_by(a, WORD_COUNT) %>%
         summarise(
             n = n(), median = median(TIME),
             mean = mean(TIME), sd = sd(TIME),
             gmean = gmean(TIME)
         )
    group_split(x)
   #+END_SRC

   #+RESULTS:
   #+begin_example
   `summarise()` has grouped output by 'a'. You can override using the `.groups` argument.
   <list_of<
     tbl_df<
       a         : character
       WORD_COUNT: integer
       n         : integer
       median    : double
       mean      : double
       sd        : double
       gmean     : double
     >
   >[3]>
   [[1]]
   # A tibble: 35 × 7
      a      WORD_COUNT     n median    mean     sd  gmean
      <chr>       <int> <int>  <dbl>   <dbl>  <dbl>  <dbl>
    1 BIGNUM          3   728  0.004 0.00686 0.0135 0
    2 BIGNUM          4  3696  0.012 0.0177  0.0344 0
    3 BIGNUM          5  5933  0.033 0.0451  0.0486 0
    4 BIGNUM          6  5273  0.072 0.0991  0.0937 0.0636
    5 BIGNUM          7  2774  0.128 0.184   0.190  0.109
    6 BIGNUM          8   944  0.206 0.304   0.330  0.172
    7 BIGNUM          9   203  0.171 0.352   0.454  0.170
    8 BIGNUM         10    29  0.111 0.193   0.222  0.114
    9 BIGNUM         11     4  0.166 0.208   0.126  0.185
   10 BIGNUM         12   137  0.492 0.727   0.715  0.428
   # … with 25 more rows
   # ℹ Use `print(n = ...)` to see more rows

   [[2]]
   # A tibble: 35 × 7
      a      WORD_COUNT     n median  mean    sd gmean
      <chr>       <int> <int>  <dbl> <dbl> <dbl> <dbl>
    1 HORNER          3   713   1.96  5.40  11.2  1.34
    2 HORNER          4  3563   3.70  8.81  14.5  3.09
    3 HORNER          5  5546   6.63 14.1   18.7  6.00
    4 HORNER          6  4760  10.0  17.6   20.1  8.75
    5 HORNER          7  2403  13.0  20.9   21.5 11.3
    6 HORNER          8   806  12.6  20.8   21.5 11.1
    7 HORNER          9   164  10.8  18.6   21.4  9.62
    8 HORNER         10    26   8.72 17.1   19.6  8.60
    9 HORNER         11     3   8.47 20.6   22.8 13.6
   10 HORNER         12   118  14.0  23.6   25.4 11.3
   # … with 25 more rows
   # ℹ Use `print(n = ...)` to see more rows

   [[3]]
   # A tibble: 35 × 7
      a      WORD_COUNT     n median   mean    sd   gmean
      <chr>       <int> <int>  <dbl>  <dbl> <dbl>   <dbl>
    1 SCALAR          3   728  0.01  0.0227 0.106 0.00948
    2 SCALAR          4  3696  0.028 0.0552 0.174 0.0267
    3 SCALAR          5  5933  0.062 0.109  0.164 0.0577
    4 SCALAR          6  5273  0.108 0.177  0.272 0.0978
    5 SCALAR          7  2774  0.154 0.255  0.807 0.143
    6 SCALAR          8   944  0.170 0.281  0.357 0.158
    7 SCALAR          9   203  0.169 0.263  0.283 0.154
    8 SCALAR         10    29  0.082 0.204  0.354 0.106
    9 SCALAR         11     4  0.274 0.263  0.181 0.202
   10 SCALAR         12   137  0.273 0.330  0.289 0.216
   # … with 25 more rows
   # ℹ Use `print(n = ...)` to see more rows
   #+end_example



   #+BEGIN_SRC R :results output :session sched
     gmean <- function(x) exp(mean(log(x)))
     data  %>% filter( s == "OPTIMUM") %>%
         group_by(a) %>%
         summarise(
             n = n(), median = median(RUNTIME),
             mean = mean(RUNTIME), sd = sd(RUNTIME),
             gmean = gmean(RUNTIME)
         )
   #+END_SRC

